Мониторинг/src/Catalogs/Конкуренты/Конкуренты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Конкуренты</name>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипКонкурента</name>
    <type>
      <types>CatalogRef.ТипыКонкурентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.БрендыКонкурентов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Номенклатура</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Магазины</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>Отдаленность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяПешком</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Мониторинг/src/Catalogs/Конкуренты/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПолучитьКоординаты(Команда)
	ПолучитьКоординатыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьКоординатыНаСервере()
	ОбщегоНазначения.ПолучитьКоординатыНаСервере(Объект);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВремяНаСервере()
	Для Каждого Стр Из Объект.Магазины Цикл
		Попытка
			Время = ОбщегоНазначения.ВычислитьВремяПути(Стр.Магазин.Широта, Стр.Магазин.Долгота, Объект.Широта, Объект.Долгота);
		Исключение
			Время = 0;
		КонецПопытки;
		Стр.ВремяПешком = Время;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВремя(Команда)
	ЗаполнитьВремяНаСервере();
КонецПроцедуры
